# ConditionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ConditionType Property
Space Class See Also
---
Get or set the Condition type of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConditionType ConditionType { get; set; }
```

Visual Basic
---
```text
Public Property ConditionType As ConditionType
	Get
	Set
```

Visual C++
---
```text
public:
property ConditionType ConditionType {
	ConditionType get ();
	void set (ConditionType value);
}
```

# Remarks
This property is used to get or set the Condition type of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace